////////////////////////////////////////////////////////
//                                                    //
//               НАСТРОЕЧНЫЕ КОНСТАНТЫ                //
//                                                    //
////////////////////////////////////////////////////////
unit Consta;
interface
const

  {$WriteableConst On}
  сLogFileName: String  = '_log.txt';   // имя лог-файла
  cTimeMessage: Cardinal = 1;           // время жизни сообщений в файле в минутах
  cTimeClear  : Cardinal = 10000;       // период очистки лог-файла от устаревших сообщений в миллисекундах

  // периоды записи в миллисекундах для потоков-писателей, длинна массива = количество потоков-писателей
  cWritePeriods  : array[0..3] of Cardinal = (2000, 5000, 7000, 3000);

implementation
end.
